astb_relise/src/DataProcessors/ПодборНоменклатурыВыдачи/ПодборНоменклатурыВыдачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПодборНоменклатурыВыдачи</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодобраннаяНоменклатура</name>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

astb_relise/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцентИзноса</name>
    <type>
      <types>CatalogRef.ПроцентыИзноса</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <comment>Номенклатура для выдачи</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАнтропометрическогоСвойства</name>
    <type>
      <types>CatalogRef.ВидыАнтропометрическихСвойств</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьВидАнтропометрическогоСвойстваПриАнализе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРост</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСИЗ</name>
    <type>
      <types>CatalogRef.ВидыСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесДляУчетаЧистки</name>
    <comment>Вес для учета чистки (химчистки) СИЗ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьКакКомплектВЗаказеПоставщикуИОтчетеДляСАП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьШтрихкод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеКоличествоЦикловЧистки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРазмеровМеньше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРазмеровБольше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможнаАвтоматизированнаяВыдача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматизированнаяВыдачаБезОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьПриФормированииЗаказовПоставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриниматьНаХранение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСбыта</name>
    <type>
      <types>EnumRef.СтатусыСбыта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаКомплектаДляППС</name>
    <type>
      <types>EnumRef.ВидыУчетаКомплектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркированнойНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыМаркированнойНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаХранения</name>
    <type>
      <types>CatalogRef.ТочкиХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодлежитУтилизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НавигационнаяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяДляПримеркиВTexel</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРоста</name>
    <type>
      <types>CatalogRef.ВидыАнтропометрическихСвойств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГОСТы</name>
    <attributes>
      <name>ГОСТ</name>
      <type>
        <types>CatalogRef.ГОСТы</types>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сертификаты</name>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/Catalogs/НормыВыдачиСИЗ/НормыВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НормыВыдачиСИЗ</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ВидВыдачиСИЗ</name>
    <type>
      <types>EnumRef.ВидыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеНормы</name>
    <type>
      <types>CatalogRef.ПунктыТОН</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>EnumRef.ВидыРасчетаНорм</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставНормы</name>
    <comment>Состав нормы (группа &quot;ИЛИ&quot;)</comment>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьВыдачи</name>
      <type>
        <types>CatalogRef.ПериодичностьВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ГОСТ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьВПотребности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьДляЛичнойКарточки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Метрика</name>
    <type>
      <types>CatalogRef.Метрики</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатистикаРаспределенияРазмера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/DataProcessors/ПодборНоменклатурыВыдачи/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Документ = Неопределено Тогда
		ВызватьИсключение НСтр("ru='Предусмотрено открытие обработки только из документов.'");
	КонецЕсли;
	
	Если Параметры.Организация.ИспользоватьПроцентИзноса Тогда
		ЗаполнитьДеревоДляПодбораСИзносом();
	Иначе
		ЗаполнитьДеревоДляПодбора();
	Конецесли;	
	
	ДеревоДанных = РеквизитФормыВЗначение("ДеревоДляПодбора");
	Если ДеревоДанных.Строки.Количество() = 0 Тогда
		Сообщить(	"Нет данных для подбора." 					+ Символы.ПС + 
					"Возможные причины: " 						+ Символы.ПС + 
					"1. Вся номенклатура выдачи уже подобрана." + Символы.ПС + 
					"2. Не задан скдад выдачи для сотрудника."	+ Символы.ПС + 
					"3. Не задано соответствие для номенклатуры выдачи.");
		Отказ = Истина;
	КонецЕсли;
	
	Объект.Организация = Параметры.Организация;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоДляПодбораСИзносом()
	
	ТаблицаДокумента = ПолучитьИзВременногоХранилища(Параметры.АдресВременногоХранилищаТаблицы);
	
	ДеревоДанных = РеквизитФормыВЗначение("ДеревоДляПодбора");
	ДеревоДанных.Строки.Очистить();
	
	ТаблицаДанных = РеквизитФормыВЗначение("ТаблицаОстатков");
	ТаблицаДанных.Очистить();
	
	ТаблицаСкладовВыдачи = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуСкладовВыдачи(Параметры.Сотрудник);
	
	//ТаблицаНоменклатурыНормСотрудников = ТаблицаДокумента.Скопировать(,"Сотрудник, НоменклатураНормы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаДокумента.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|ГДЕ
	|	НЕ ТаблицаДокумента.НеВыдано
	|	И ТаблицаДокумента.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК Ссылка,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_СоставНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_СоставНормы.НоменклатураНормы КАК НоменклатураНормы
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_ТаблицаДокумента.НормаВыдачи = ВТ_СоставНормы.Ссылка";
	
	Запрос.УстановитьПараметр("ТаблицаДокумента",ТаблицаДокумента);	

	ТаблицаНоменклатурыНормСотрудников = Запрос.Выполнить().Выгрузить();
	
	ТаблицаРазмеров = ПроцедурыРаботыСНормамиСервер.ПодобратьРазмерыДляСотрудников(ТаблицаНоменклатурыНормСотрудников,Параметры.Дата,Параметры.Организация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.НеВыдано КАК НеВыдано,
	|	ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ТаблицаДокумента.КоличествоПотребность КАК КоличествоПотребность,
	|	ТаблицаДокумента.ДатаВыдачи КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|ГДЕ
	|	НЕ ТаблицаДокумента.НеВыдано
	|	И ТаблицаДокумента.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРазмеров.Сотрудник КАК Сотрудник,
	|	ТаблицаРазмеров.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаРазмеров.Номенклатура КАК Номенклатура,
	|	ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаРазмеров.ПолНоменклатуры КАК ПолНоменклатуры,
	|	ТаблицаРазмеров.ЕстьРазмеры КАК ЕстьРазмеры,
	|	ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ТаблицаРазмеров.Приоритет КАК Приоритет,
	|	ТаблицаРазмеров.ПриоритетРазмера КАК ПриоритетРазмера,
	|	ТаблицаРазмеров.ТолькоДляСотрудника КАК ТолькоДляСотрудника,
	|	ТаблицаРазмеров.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ТаблицаРазмеров.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ТаблицаРазмеров.Рост КАК Рост,
	|	ТаблицаРазмеров.ИспользоватьРост КАК ИспользоватьРост,
	|	ТаблицаРазмеров.ВидСИЗ КАК ВидСИЗ,
	|	ТаблицаРазмеров.Комплект КАК Комплект,
	|	ТаблицаРазмеров.КоличествоВКомплекте КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаРазмеров
	|ИЗ
	|	&ТаблицаРазмеров КАК ТаблицаРазмеров
	|ГДЕ
	|	ТаблицаРазмеров.КоличествоВКомплекте = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСкладовВыдачи.Склад КАК Склад,
	|	ТаблицаСкладовВыдачи.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ
	|ПОМЕСТИТЬ ВТ_ТаблицаСкладовВыдачи
	|ИЗ
	|	&ТаблицаСкладовВыдачи КАК ТаблицаСкладовВыдачи
	|ГДЕ
	|	ТаблицаСкладовВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Склад КАК Склад,
	|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОстаткиНоменклатурыОстатки.ПроцентИзноса КАК ПроцентИзноса,
	|	СУММА(ОстаткиНоменклатурыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиНаСкладах
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&ПериодРасчета, Организация = &ОрганизацияДляОстатков) КАК ОстаткиНоменклатурыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНоменклатурыОстатки.Склад,
	|	ОстаткиНоменклатурыОстатки.Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры,
	|	ОстаткиНоменклатурыОстатки.ПроцентИзноса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК НормаВыдачи,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_СоставНормВыдачи
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокумента.НеВыдано КАК НеВыдано,
	|	ВТ_ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_СоставНормВыдачи.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_СоставНормВыдачи.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокумента.НоменклатураНормы = ВТ_СоставНормВыдачи.НоменклатураНормы
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НоменклатураНормыЕстьВДокументе,
	|	ВТ_ТаблицаДокумента.Количество КАК Количество,
	|	ВТ_ТаблицаДокумента.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаДокумента.ДатаВыдачи КАК ДатаВыдачи,
	|	ВЫБОР
	|		КОГДА ВТ_СоставНормВыдачи.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|			ТОГДА ДОБАВИТЬКДАТЕ(&ПериодРасчета, ГОД, ВТ_СоставНормВыдачи.ПериодичностьВыдачи.КоличествоПериодов)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&ПериодРасчета, МЕСЯЦ, ВТ_СоставНормВыдачи.ПериодичностьВыдачи.КоличествоПериодов)
	|	КОНЕЦ КАК ДатаСледующейВыдачи
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаССоставом
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормВыдачи КАК ВТ_СоставНормВыдачи
	|		ПО ВТ_ТаблицаДокумента.НормаВыдачи = ВТ_СоставНормВыдачи.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
	|	ХарактеристикиНоменклатуры.Ссылка КАК ХарактеристикаНоменклатуры,
	|	ХарактеристикиНоменклатуры.Метрика КАК Метрика
	|ПОМЕСТИТЬ ВТ_ХарактеристикиНоменклатуры
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокументаССоставом.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокументаССоставом.НеВыдано КАК НеВыдано,
	|	ВТ_ТаблицаДокументаССоставом.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокументаССоставом.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокументаССоставом.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ТаблицаДокументаССоставом.НоменклатураНормыЕстьВДокументе КАК НоменклатураНормыЕстьВДокументе,
	|	ВТ_ТаблицаРазмеров.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_ТаблицаРазмеров.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаРазмеров.ЕстьРазмеры КАК ЕстьХарактеристики,
	|	ВТ_ТаблицаДокументаССоставом.Количество КАК Количество,
	|	ВТ_ТаблицаДокументаССоставом.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаРазмеров.Приоритет КАК ПриоритетСоответствия,
	|	ВТ_ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетУсловия,
	|	ВТ_ТаблицаДокументаССоставом.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокументаССоставом.ДатаСледующейВыдачи КАК ДатаСледующейВыдачи
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаСМаппингом
	|ИЗ
	|	ВТ_ТаблицаДокументаССоставом КАК ВТ_ТаблицаДокументаССоставом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаРазмеров КАК ВТ_ТаблицаРазмеров
	|		ПО ВТ_ТаблицаДокументаССоставом.НоменклатураНормы = ВТ_ТаблицаРазмеров.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокументаСМаппингом.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокументаСМаппингом.НеВыдано КАК НеВыдано,
	|	ВТ_ТаблицаДокументаСМаппингом.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокументаСМаппингом.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокументаСМаппингом.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ТаблицаДокументаСМаппингом.НоменклатураНормыЕстьВДокументе КАК НоменклатураНормыЕстьВДокументе,
	|	ВТ_ТаблицаДокументаСМаппингом.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_ХарактеристикиНоменклатуры.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаДокументаСМаппингом.ЕстьХарактеристики КАК ЕстьХарактеристики,
	|	ВТ_ТаблицаДокументаСМаппингом.Количество КАК Количество,
	|	ВТ_ТаблицаДокументаСМаппингом.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаДокументаСМаппингом.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ТаблицаДокументаСМаппингом.ПриоритетУсловия КАК ПриоритетУсловия,
	|	ВТ_ХарактеристикиНоменклатуры.ХарактеристикаНоменклатуры = ВТ_ТаблицаДокументаСМаппингом.ХарактеристикаНоменклатуры КАК РазмерПодходит,
	|	ВТ_ТаблицаДокументаСМаппингом.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокументаСМаппингом.ДатаСледующейВыдачи КАК ДатаСледующейВыдачи
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаСАнтропометрией
	|ИЗ
	|	ВТ_ТаблицаДокументаСМаппингом КАК ВТ_ТаблицаДокументаСМаппингом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ХарактеристикиНоменклатуры КАК ВТ_ХарактеристикиНоменклатуры
	|		ПО ВТ_ТаблицаДокументаСМаппингом.Номенклатура = ВТ_ХарактеристикиНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
	|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокументаСАнтропометрией.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокументаСАнтропометрией.НеВыдано КАК НеВыдано,
	|	ВТ_ТаблицаДокументаСАнтропометрией.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокументаСАнтропометрией.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокументаСАнтропометрией.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ТаблицаДокументаСАнтропометрией.НоменклатураНормыЕстьВДокументе КАК НоменклатураНормыЕстьВДокументе,
	|	ВТ_ТаблицаДокументаСАнтропометрией.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаДокументаСАнтропометрией.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаДокументаСАнтропометрией.ЕстьХарактеристики КАК ЕстьХарактеристики,
	|	ВТ_ТаблицаДокументаСАнтропометрией.Количество КАК Количество,
	|	ВТ_ТаблицаДокументаСАнтропометрией.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаДокументаСАнтропометрией.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ТаблицаДокументаСАнтропометрией.ПриоритетУсловия КАК ПриоритетУсловия,
	|	ВТ_ТаблицаДокументаСАнтропометрией.РазмерПодходит КАК РазмерПодходит,
	|	ВТ_ТаблицаДокументаСАнтропометрией.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокументаСАнтропометрией.ДатаСледующейВыдачи КАК ДатаСледующейВыдачи,
	|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаСЦенами
	|ИЗ
	|	ВТ_ТаблицаДокументаСАнтропометрией КАК ВТ_ТаблицаДокументаСАнтропометрией
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|		ПО ВТ_ТаблицаДокументаСАнтропометрией.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокументаСЦенами.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокументаСЦенами.НеВыдано КАК НеВыдано,
	|	ВТ_ТаблицаДокументаСЦенами.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокументаСЦенами.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокументаСЦенами.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ТаблицаДокументаСЦенами.НоменклатураНормыЕстьВДокументе КАК НоменклатураНормыЕстьВДокументе,
	|	ВТ_ТаблицаДокументаСЦенами.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаДокументаСЦенами.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаДокументаСЦенами.ЕстьХарактеристики КАК ЕстьХарактеристики,
	|	ВТ_ТаблицаДокументаСЦенами.Количество КАК Количество,
	|	ВТ_ТаблицаДокументаСЦенами.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаДокументаСЦенами.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ТаблицаДокументаСЦенами.ПриоритетУсловия КАК ПриоритетУсловия,
	|	ВТ_ТаблицаДокументаСЦенами.РазмерПодходит КАК РазмерПодходит,
	|	ВТ_ТаблицаДокументаСЦенами.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокументаСЦенами.ДатаСледующейВыдачи КАК ДатаСледующейВыдачи,
	|	ВТ_ТаблицаДокументаСЦенами.Цена КАК Цена,
	|	ВТ_ТаблицаСкладовВыдачи.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаСоСкладами
	|ИЗ
	|	ВТ_ТаблицаДокументаСЦенами КАК ВТ_ТаблицаДокументаСЦенами,
	|	ВТ_ТаблицаСкладовВыдачи КАК ВТ_ТаблицаСкладовВыдачи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаДокументаСЦенами.НомерСтроки,
	|	ВТ_ТаблицаДокументаСЦенами.НеВыдано,
	|	ВТ_ТаблицаДокументаСЦенами.НормаВыдачи,
	|	ВТ_ТаблицаДокументаСЦенами.НоменклатураНормы,
	|	ВТ_ТаблицаДокументаСЦенами.ПериодичностьВыдачи,
	|	ВТ_ТаблицаДокументаСЦенами.НоменклатураНормыЕстьВДокументе,
	|	ВТ_ТаблицаДокументаСЦенами.Номенклатура,
	|	ВТ_ТаблицаДокументаСЦенами.ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаДокументаСЦенами.Количество,
	|	ВТ_ТаблицаДокументаСЦенами.КоличествоПотребность,
	|	ВТ_ТаблицаДокументаСЦенами.ДатаВыдачи,
	|	ВТ_ТаблицаДокументаСЦенами.ДатаСледующейВыдачи,
	|	ВТ_ТаблицаСкладовВыдачи.Склад,
	|	ВТ_ТаблицаДокументаСЦенами.Цена,
	|	ВТ_ТаблицаДокументаСЦенами.ЕстьХарактеристики,
	|	ВТ_ТаблицаДокументаСЦенами.ПриоритетСоответствия,
	|	ВТ_ТаблицаДокументаСЦенами.ПриоритетУсловия,
	|	ВТ_ТаблицаДокументаСЦенами.РазмерПодходит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокументаСоСкладами.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокументаСоСкладами.НеВыдано КАК НеВыдано,
	|	ВТ_ТаблицаДокументаСоСкладами.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокументаСоСкладами.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокументаСоСкладами.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ТаблицаДокументаСоСкладами.НоменклатураНормыЕстьВДокументе КАК НоменклатураНормыЕстьВДокументе,
	|	ВТ_ТаблицаДокументаСоСкладами.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаДокументаСоСкладами.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ВТ_ОстаткиНаСкладах.ПроцентИзноса, ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка)) КАК ПроцентИзноса,
	|	ВТ_ТаблицаДокументаСоСкладами.ЕстьХарактеристики КАК ЕстьХарактеристики,
	|	ВТ_ТаблицаДокументаСоСкладами.Количество КАК Количество,
	|	ВТ_ТаблицаДокументаСоСкладами.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаДокументаСоСкладами.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ТаблицаДокументаСоСкладами.ПриоритетУсловия КАК ПриоритетУсловия,
	|	ВТ_ТаблицаДокументаСоСкладами.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокументаСоСкладами.ДатаСледующейВыдачи КАК ДатаСледующейВыдачи,
	|	ВТ_ТаблицаДокументаСоСкладами.РазмерПодходит КАК РазмерПодходит,
	|	ВТ_ТаблицаДокументаСоСкладами.Цена КАК Цена,
	|	ВТ_ТаблицаДокументаСоСкладами.Склад КАК Склад,
	|	ЕСТЬNULL(ВТ_ОстаткиНаСкладах.КоличествоОстаток, 0) КАК Остаток
	|ИЗ
	|	ВТ_ТаблицаДокументаСоСкладами КАК ВТ_ТаблицаДокументаСоСкладами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНаСкладах КАК ВТ_ОстаткиНаСкладах
	|		ПО ВТ_ТаблицаДокументаСоСкладами.Номенклатура = ВТ_ОстаткиНаСкладах.Номенклатура
	|			И ВТ_ТаблицаДокументаСоСкладами.ХарактеристикаНоменклатуры = ВТ_ОстаткиНаСкладах.ХарактеристикаНоменклатуры
	|			И ВТ_ТаблицаДокументаСоСкладами.Склад = ВТ_ОстаткиНаСкладах.Склад
	|ГДЕ
	|	НЕ ВТ_ТаблицаДокументаСоСкладами.Номенклатура ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ПриоритетУсловия,
	|	ПриоритетСоответствия,
	|	ВТ_ТаблицаДокументаСоСкладами.ХарактеристикаНоменклатуры.КодSAP,
	|	ВТ_ОстаткиНаСкладах.ПроцентИзноса.Код
	|ИТОГИ ПО
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	ПроцентИзноса";
	
	Запрос.УстановитьПараметр("ПериодРасчета",				Параметры.Дата);
	Запрос.УстановитьПараметр("Организация",				Параметры.Организация);
	Запрос.УстановитьПараметр("ВидВыдачиСИЗ",				Параметры.ВидВыдачиСИЗ);
	Запрос.УстановитьПараметр("ТаблицаДокумента",			ТаблицаДокумента);
	Запрос.УстановитьПараметр("ТаблицаСкладовВыдачи",		ТаблицаСкладовВыдачи);
	Запрос.УстановитьПараметр("ТаблицаРазмеров", 			ТаблицаРазмеров);
	Запрос.УстановитьПараметр("ОрганизацияДляОстатков",		?(ПолучитьФункциональнуюОпцию("НеВестиУчетОстатковНоменклатурыПоОрганизации"),Справочники.Организации.ПустаяСсылка(),Параметры.Организация));

	КорневаяВетка = ДеревоДанных.Строки.Добавить();
	КорневаяВетка.Представление = "Данные для подбора в документ выдачи";
	
	ВыборкаПоНормеВыдачи = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоНормеВыдачи.Следующий() Цикл
		
		ВеткаНормыВыдачи 						= КорневаяВетка.Строки.Добавить();
		ВеткаНормыВыдачи.НормаВыдачи 			= ВыборкаПоНормеВыдачи.НормаВыдачи;
		ВеткаНормыВыдачи.Представление 			= СокрЛП(ВыборкаПоНормеВыдачи.НормаВыдачи.Наименование);
		
		ВыборкаПоНоменклатуреНормы = ВыборкаПоНормеВыдачи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоНоменклатуреНормы.Следующий() Цикл
			
			ВеткаНоменклатурыНормы = ВеткаНормыВыдачи.Строки.Добавить();
			ВеткаНоменклатурыНормы.НоменклатураНормы 		= ВыборкаПоНоменклатуреНормы.НоменклатураНормы;
			ВеткаНоменклатурыНормы.КоличествоПотребность 	= ВыборкаПоНоменклатуреНормы.КоличествоПотребность;
			
			ВеткаНоменклатурыНормыЗаполнена = Ложь;
			
			ВыборкаПоНоменклатуре = ВыборкаПоНоменклатуреНормы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоНоменклатуре.Следующий() Цикл
				
				ВеткаНоменклатуры = ВеткаНоменклатурыНормы.Строки.Добавить();
				ВеткаНоменклатуры.Номенклатура 	= ВыборкаПоНоменклатуре.Номенклатура;
				ВеткаНоменклатуры.Количество 	= ВыборкаПоНоменклатуре.Количество;
				
				ВеткаНоменклатурыЗаполнена = Ложь;
				
				ВыборкаПоХарактеристикам = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоХарактеристикам.Следующий() Цикл
					
					ВыборкаПоИзносу = ВыборкаПоХарактеристикам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПоИзносу.Следующий() Цикл
						
						ВеткаРазмера = ВеткаНоменклатуры.Строки.Добавить();
						ВеткаРазмера.ХарактеристикаНоменклатуры = ВыборкаПоХарактеристикам.ХарактеристикаНоменклатуры;
						ВеткаРазмера.ПроцентИзноса 				= ВыборкаПоИзносу.ПроцентИзноса;
						
						ВеткаРазмераЗаполнена = Ложь;
						
						ВыборкаПоСкладам = ВыборкаПоИзносу.Выбрать();
						Пока ВыборкаПоСкладам.Следующий() Цикл
							
							ВеткаНормыВыдачи.НомерСтрокиДокумента = ВыборкаПоСкладам.НомерСтроки;
							
							Если НЕ ВеткаНоменклатурыНормыЗаполнена Тогда
								ВеткаНоменклатурыНормы.Представление 		= СокрЛП(ВыборкаПоНоменклатуреНормы.НоменклатураНормы.Наименование) + " Требуется: "  +  ВыборкаПоСкладам.КоличествоПотребность;
								ВеткаНоменклатурыНормы.ДатаВыдачи			= ВыборкаПоСкладам.ДатаВыдачи;
								ВеткаНоменклатурыНормы.ДатаCледующейВыдачи 	= ВыборкаПоСкладам.ДатаСледующейВыдачи;
								ВеткаНоменклатурыНормыЗаполнена 			= Истина;
							КонецЕсли;
							
							Если НЕ ВеткаНоменклатурыЗаполнена Тогда
								ВеткаНоменклатуры.Представление 			= СокрЛП(ВыборкаПоНоменклатуре.Номенклатура.Наименование) + " К выдаче: " + ВыборкаПоСкладам.Количество;
								ВеткаНоменклатуры.Цена 						= ВыборкаПоСкладам.Цена;
								ВеткаНоменклатурыЗаполнена = Истина;
							КонецЕсли;
							
							Если НЕ ВеткаРазмераЗаполнена Тогда
								Если ЗначениеЗаполнено(ВыборкаПоИзносу.ПроцентИзноса) Тогда
									
									Если ВыборкаПоСкладам.ЕстьХарактеристики Тогда
										Если ВыборкаПоСкладам.РазмерПодходит Тогда
											ВеткаРазмера.Представление 	= СокрЛП(ВыборкаПоХарактеристикам.ХарактеристикаНоменклатуры.Наименование) + " (подходит по антропометрии). Износ " + ВыборкаПоИзносу.ПроцентИзноса.Код + "%"; 
											ВеткаРазмера.РазмерПодходит = Истина;
										Иначе
											ВеткаРазмера.Представление = СокрЛП(ВыборкаПоХарактеристикам.ХарактеристикаНоменклатуры.Наименование) + " Износ "  + ВыборкаПоИзносу.ПроцентИзноса.Код + "%";
										КонецЕсли;
									Иначе
										ВеткаРазмера.Представление = "Без размера. Износ "  + ВыборкаПоИзносу.ПроцентИзноса.Код + "%";
										ВеткаРазмера.РазмерПодходит = Истина;
									КонецЕсли;
									
								Иначе
									
									Если ВыборкаПоСкладам.ЕстьХарактеристики Тогда
										Если ВыборкаПоСкладам.РазмерПодходит Тогда
											ВеткаРазмера.Представление 	= СокрЛП(ВыборкаПоХарактеристикам.ХарактеристикаНоменклатуры.Наименование) + " (подходит по антропометрии). Без износа."; 
											ВеткаРазмера.РазмерПодходит = Истина;
										Иначе
											ВеткаРазмера.Представление = СокрЛП(ВыборкаПоХарактеристикам.ХарактеристикаНоменклатуры.Наименование) + " Без износа.";
										КонецЕсли;
									Иначе
										ВеткаРазмера.Представление = "Без размера. Без износа.";
										ВеткаРазмера.РазмерПодходит = Истина;
									КонецЕсли;
									
								КонецЕсли;
								
								ВеткаРазмераЗаполнена = Истина;
								
							КонецЕсли;
							
							НоваяСтрока = ТаблицаДанных.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаПоСкладам);
							НоваяСтрока.СкладДокумента = (НоваяСтрока.Склад = Параметры.Склад);
							
							Если ВыборкаПоСкладам.Склад = Параметры.Склад Тогда
								Если ВыборкаПоСкладам.Остаток > 0 Тогда
									ВеткаРазмера.ЕстьНаСкладеДокумента 	= Истина;
									ВеткаРазмера.ЕстьНаДругихСкладах 	= Ложь;
								КонецЕсли;
							Иначе
								Если ВыборкаПоСкладам.Остаток > 0 И (НЕ ВеткаРазмера.ЕстьНаСкладеДокумента) Тогда
									ВеткаРазмера.ЕстьНаДругихСкладах 	= Истина;
								КонецЕсли;
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЦикла
			
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаДанных.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ПроцентИзноса, Склад, Остаток, СкладДокумента");
	
	ЗначениеВРеквизитФормы(ДеревоДанных,	"ДеревоДляПодбора");
	ЗначениеВРеквизитФормы(ТаблицаДанных,	"ТаблицаОстатков");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоДляПодбора()
	
	ТаблицаДокумента = ПолучитьИзВременногоХранилища(Параметры.АдресВременногоХранилищаТаблицы);
	
	ДеревоДанных = РеквизитФормыВЗначение("ДеревоДляПодбора");
	ДеревоДанных.Строки.Очистить();
	
	ТаблицаДанных = РеквизитФормыВЗначение("ТаблицаОстатков");
	ТаблицаДанных.Очистить();
	
	ТаблицаСкладовВыдачи = ПроцедурыРаботыСНормамиСервер.ПолучитьТаблицуСкладовВыдачи(Параметры.Сотрудник);
	
	//ТаблицаНоменклатурыНормСотрудников = ТаблицаДокумента.Скопировать(,"Сотрудник, НоменклатураНормы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаДокумента.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|ГДЕ
	|	НЕ ТаблицаДокумента.НеВыдано
	|	И ТаблицаДокумента.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК Ссылка,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы
	|ПОМЕСТИТЬ ВТ_СоставНормы
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_СоставНормы.НоменклатураНормы КАК НоменклатураНормы
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормы КАК ВТ_СоставНормы
	|		ПО ВТ_ТаблицаДокумента.НормаВыдачи = ВТ_СоставНормы.Ссылка";
	
	Запрос.УстановитьПараметр("ТаблицаДокумента",ТаблицаДокумента);	

	ТаблицаНоменклатурыНормСотрудников = Запрос.Выполнить().Выгрузить();
	
	ТаблицаРазмеров = ПроцедурыРаботыСНормамиСервер.ПодобратьРазмерыДляСотрудников(ТаблицаНоменклатурыНормСотрудников,Параметры.Дата,Параметры.Организация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.НеВыдано КАК НеВыдано,
	|	ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ТаблицаДокумента.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ТаблицаДокумента.КоличествоПотребность КАК КоличествоПотребность,
	|	ТаблицаДокумента.ДатаВыдачи КАК ДатаВыдачи
	|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|ГДЕ
	|	НЕ ТаблицаДокумента.НеВыдано
	|	И ТаблицаДокумента.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРазмеров.Сотрудник КАК Сотрудник,
	|	ТаблицаРазмеров.НоменклатураНормы КАК НоменклатураНормы,
	|	ТаблицаРазмеров.Номенклатура КАК Номенклатура,
	|	ТаблицаРазмеров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаРазмеров.ПолНоменклатуры КАК ПолНоменклатуры,
	|	ТаблицаРазмеров.ЕстьРазмеры КАК ЕстьРазмеры,
	|	ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ТаблицаРазмеров.Приоритет КАК Приоритет,
	|	ТаблицаРазмеров.ПриоритетРазмера КАК ПриоритетРазмера,
	|	ТаблицаРазмеров.ТолькоДляСотрудника КАК ТолькоДляСотрудника,
	|	ТаблицаРазмеров.ВидАнтропометрии КАК ВидАнтропометрии,
	|	ТаблицаРазмеров.ЗначениеАнтропометрии КАК ЗначениеАнтропометрии,
	|	ТаблицаРазмеров.Рост КАК Рост,
	|	ТаблицаРазмеров.ИспользоватьРост КАК ИспользоватьРост,
	|	ТаблицаРазмеров.ВидСИЗ КАК ВидСИЗ,
	|	ТаблицаРазмеров.Комплект КАК Комплект,
	|	ТаблицаРазмеров.КоличествоВКомплекте КАК Количество
	|ПОМЕСТИТЬ ВТ_ТаблицаРазмеров
	|ИЗ
	|	&ТаблицаРазмеров КАК ТаблицаРазмеров
	|ГДЕ
	|	ТаблицаРазмеров.КоличествоВКомплекте = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСкладовВыдачи.Склад КАК Склад,
	|	ТаблицаСкладовВыдачи.ВидВыдачиСИЗ КАК ВидВыдачиСИЗ
	|ПОМЕСТИТЬ ВТ_ТаблицаСкладовВыдачи
	|ИЗ
	|	&ТаблицаСкладовВыдачи КАК ТаблицаСкладовВыдачи
	|ГДЕ
	|	ТаблицаСкладовВыдачи.ВидВыдачиСИЗ = &ВидВыдачиСИЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиНоменклатурыОстатки.Склад КАК Склад,
	|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ОстаткиНоменклатурыОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиНаСкладах
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&ПериодРасчета, Организация = &ОрганизацияДляОстатков) КАК ОстаткиНоменклатурыОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНоменклатурыОстатки.Склад,
	|	ОстаткиНоменклатурыОстатки.Номенклатура,
	|	ОстаткиНоменклатурыОстатки.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НормыВыдачиСИЗСоставНормы.Ссылка КАК НормаВыдачи,
	|	НормыВыдачиСИЗСоставНормы.НоменклатураНормы КАК НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи КАК ПериодичностьВыдачи
	|ПОМЕСТИТЬ ВТ_СоставНормВыдачи
	|ИЗ
	|	Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокумента.НеВыдано КАК НеВыдано,
	|	ВТ_ТаблицаДокумента.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_СоставНормВыдачи.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_СоставНормВыдачи.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаДокумента.НоменклатураНормы = ВТ_СоставНормВыдачи.НоменклатураНормы
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НоменклатураНормыЕстьВДокументе,
	|	ВТ_ТаблицаДокумента.Количество КАК Количество,
	|	ВТ_ТаблицаДокумента.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаДокумента.ДатаВыдачи КАК ДатаВыдачи,
	|	ВЫБОР
	|		КОГДА ВТ_СоставНормВыдачи.ПериодичностьВыдачи.ТипПериода = ЗНАЧЕНИЕ(Перечисление.ДоступныеПериодыОтчета.Год)
	|			ТОГДА ДОБАВИТЬКДАТЕ(&ПериодРасчета, ГОД, ВТ_СоставНормВыдачи.ПериодичностьВыдачи.КоличествоПериодов)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&ПериодРасчета, МЕСЯЦ, ВТ_СоставНормВыдачи.ПериодичностьВыдачи.КоличествоПериодов)
	|	КОНЕЦ КАК ДатаСледующейВыдачи
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаССоставом
	|ИЗ
	|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоставНормВыдачи КАК ВТ_СоставНормВыдачи
	|		ПО ВТ_ТаблицаДокумента.НормаВыдачи = ВТ_СоставНормВыдачи.НормаВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура,
	|	ХарактеристикиНоменклатуры.Ссылка КАК ХарактеристикаНоменклатуры,
	|	ХарактеристикиНоменклатуры.Метрика КАК Метрика
	|ПОМЕСТИТЬ ВТ_ХарактеристикиНоменклатуры
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокументаССоставом.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокументаССоставом.НеВыдано КАК НеВыдано,
	|	ВТ_ТаблицаДокументаССоставом.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокументаССоставом.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокументаССоставом.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ТаблицаДокументаССоставом.НоменклатураНормыЕстьВДокументе КАК НоменклатураНормыЕстьВДокументе,
	|	ВТ_ТаблицаРазмеров.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_ТаблицаРазмеров.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаРазмеров.ЕстьРазмеры КАК ЕстьХарактеристики,
	|	ВТ_ТаблицаДокументаССоставом.Количество КАК Количество,
	|	ВТ_ТаблицаДокументаССоставом.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаРазмеров.Приоритет КАК ПриоритетСоответствия,
	|	ВТ_ТаблицаРазмеров.ПриоритетСоответствия КАК ПриоритетУсловия,
	|	ВТ_ТаблицаДокументаССоставом.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокументаССоставом.ДатаСледующейВыдачи КАК ДатаСледующейВыдачи
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаСМаппингом
	|ИЗ
	|	ВТ_ТаблицаДокументаССоставом КАК ВТ_ТаблицаДокументаССоставом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаРазмеров КАК ВТ_ТаблицаРазмеров
	|		ПО ВТ_ТаблицаДокументаССоставом.НоменклатураНормы = ВТ_ТаблицаРазмеров.НоменклатураНормы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокументаСМаппингом.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокументаСМаппингом.НеВыдано КАК НеВыдано,
	|	ВТ_ТаблицаДокументаСМаппингом.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокументаСМаппингом.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокументаСМаппингом.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ТаблицаДокументаСМаппингом.НоменклатураНормыЕстьВДокументе КАК НоменклатураНормыЕстьВДокументе,
	|	ВТ_ТаблицаДокументаСМаппингом.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_ХарактеристикиНоменклатуры.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаДокументаСМаппингом.ЕстьХарактеристики КАК ЕстьХарактеристики,
	|	ВТ_ТаблицаДокументаСМаппингом.Количество КАК Количество,
	|	ВТ_ТаблицаДокументаСМаппингом.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаДокументаСМаппингом.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ТаблицаДокументаСМаппингом.ПриоритетУсловия КАК ПриоритетУсловия,
	|	ВТ_ХарактеристикиНоменклатуры.ХарактеристикаНоменклатуры = ВТ_ТаблицаДокументаСМаппингом.ХарактеристикаНоменклатуры КАК РазмерПодходит,
	|	ВТ_ТаблицаДокументаСМаппингом.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокументаСМаппингом.ДатаСледующейВыдачи КАК ДатаСледующейВыдачи
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаСАнтропометрией
	|ИЗ
	|	ВТ_ТаблицаДокументаСМаппингом КАК ВТ_ТаблицаДокументаСМаппингом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ХарактеристикиНоменклатуры КАК ВТ_ХарактеристикиНоменклатуры
	|		ПО ВТ_ТаблицаДокументаСМаппингом.Номенклатура = ВТ_ХарактеристикиНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
	|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодРасчета, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокументаСАнтропометрией.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокументаСАнтропометрией.НеВыдано КАК НеВыдано,
	|	ВТ_ТаблицаДокументаСАнтропометрией.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокументаСАнтропометрией.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокументаСАнтропометрией.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ТаблицаДокументаСАнтропометрией.НоменклатураНормыЕстьВДокументе КАК НоменклатураНормыЕстьВДокументе,
	|	ВТ_ТаблицаДокументаСАнтропометрией.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаДокументаСАнтропометрией.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаДокументаСАнтропометрией.ЕстьХарактеристики КАК ЕстьХарактеристики,
	|	ВТ_ТаблицаДокументаСАнтропометрией.Количество КАК Количество,
	|	ВТ_ТаблицаДокументаСАнтропометрией.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаДокументаСАнтропометрией.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ТаблицаДокументаСАнтропометрией.ПриоритетУсловия КАК ПриоритетУсловия,
	|	ВТ_ТаблицаДокументаСАнтропометрией.РазмерПодходит КАК РазмерПодходит,
	|	ВТ_ТаблицаДокументаСАнтропометрией.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокументаСАнтропометрией.ДатаСледующейВыдачи КАК ДатаСледующейВыдачи,
	|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаСЦенами
	|ИЗ
	|	ВТ_ТаблицаДокументаСАнтропометрией КАК ВТ_ТаблицаДокументаСАнтропометрией
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
	|		ПО ВТ_ТаблицаДокументаСАнтропометрией.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокументаСЦенами.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокументаСЦенами.НеВыдано КАК НеВыдано,
	|	ВТ_ТаблицаДокументаСЦенами.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокументаСЦенами.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокументаСЦенами.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ТаблицаДокументаСЦенами.НоменклатураНормыЕстьВДокументе КАК НоменклатураНормыЕстьВДокументе,
	|	ВТ_ТаблицаДокументаСЦенами.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаДокументаСЦенами.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаДокументаСЦенами.ЕстьХарактеристики КАК ЕстьХарактеристики,
	|	ВТ_ТаблицаДокументаСЦенами.Количество КАК Количество,
	|	ВТ_ТаблицаДокументаСЦенами.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаДокументаСЦенами.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ТаблицаДокументаСЦенами.ПриоритетУсловия КАК ПриоритетУсловия,
	|	ВТ_ТаблицаДокументаСЦенами.РазмерПодходит КАК РазмерПодходит,
	|	ВТ_ТаблицаДокументаСЦенами.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокументаСЦенами.ДатаСледующейВыдачи КАК ДатаСледующейВыдачи,
	|	ВТ_ТаблицаДокументаСЦенами.Цена КАК Цена,
	|	ВТ_ТаблицаСкладовВыдачи.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_ТаблицаДокументаСоСкладами
	|ИЗ
	|	ВТ_ТаблицаДокументаСЦенами КАК ВТ_ТаблицаДокументаСЦенами,
	|	ВТ_ТаблицаСкладовВыдачи КАК ВТ_ТаблицаСкладовВыдачи
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТаблицаДокументаСЦенами.НомерСтроки,
	|	ВТ_ТаблицаДокументаСЦенами.НеВыдано,
	|	ВТ_ТаблицаДокументаСЦенами.НормаВыдачи,
	|	ВТ_ТаблицаДокументаСЦенами.НоменклатураНормы,
	|	ВТ_ТаблицаДокументаСЦенами.ПериодичностьВыдачи,
	|	ВТ_ТаблицаДокументаСЦенами.НоменклатураНормыЕстьВДокументе,
	|	ВТ_ТаблицаДокументаСЦенами.Номенклатура,
	|	ВТ_ТаблицаДокументаСЦенами.ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаДокументаСЦенами.Количество,
	|	ВТ_ТаблицаДокументаСЦенами.КоличествоПотребность,
	|	ВТ_ТаблицаДокументаСЦенами.ДатаВыдачи,
	|	ВТ_ТаблицаДокументаСЦенами.ДатаСледующейВыдачи,
	|	ВТ_ТаблицаСкладовВыдачи.Склад,
	|	ВТ_ТаблицаДокументаСЦенами.Цена,
	|	ВТ_ТаблицаДокументаСЦенами.ЕстьХарактеристики,
	|	ВТ_ТаблицаДокументаСЦенами.ПриоритетСоответствия,
	|	ВТ_ТаблицаДокументаСЦенами.ПриоритетУсловия,
	|	ВТ_ТаблицаДокументаСЦенами.РазмерПодходит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаДокументаСоСкладами.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаДокументаСоСкладами.НеВыдано КАК НеВыдано,
	|	ВТ_ТаблицаДокументаСоСкладами.НормаВыдачи КАК НормаВыдачи,
	|	ВТ_ТаблицаДокументаСоСкладами.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ТаблицаДокументаСоСкладами.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
	|	ВТ_ТаблицаДокументаСоСкладами.НоменклатураНормыЕстьВДокументе КАК НоменклатураНормыЕстьВДокументе,
	|	ВТ_ТаблицаДокументаСоСкладами.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаДокументаСоСкладами.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ТаблицаДокументаСоСкладами.ЕстьХарактеристики КАК ЕстьХарактеристики,
	|	ВТ_ТаблицаДокументаСоСкладами.Количество КАК Количество,
	|	ВТ_ТаблицаДокументаСоСкладами.КоличествоПотребность КАК КоличествоПотребность,
	|	ВТ_ТаблицаДокументаСоСкладами.ПриоритетСоответствия КАК ПриоритетСоответствия,
	|	ВТ_ТаблицаДокументаСоСкладами.ПриоритетУсловия КАК ПриоритетУсловия,
	|	ВТ_ТаблицаДокументаСоСкладами.ДатаВыдачи КАК ДатаВыдачи,
	|	ВТ_ТаблицаДокументаСоСкладами.ДатаСледующейВыдачи КАК ДатаСледующейВыдачи,
	|	ВТ_ТаблицаДокументаСоСкладами.РазмерПодходит КАК РазмерПодходит,
	|	ВТ_ТаблицаДокументаСоСкладами.Цена КАК Цена,
	|	ВТ_ТаблицаДокументаСоСкладами.Склад КАК Склад,
	|	ЕСТЬNULL(ВТ_ОстаткиНаСкладах.КоличествоОстаток, 0) КАК Остаток
	|ИЗ
	|	ВТ_ТаблицаДокументаСоСкладами КАК ВТ_ТаблицаДокументаСоСкладами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНаСкладах КАК ВТ_ОстаткиНаСкладах
	|		ПО ВТ_ТаблицаДокументаСоСкладами.Номенклатура = ВТ_ОстаткиНаСкладах.Номенклатура
	|			И ВТ_ТаблицаДокументаСоСкладами.ХарактеристикаНоменклатуры = ВТ_ОстаткиНаСкладах.ХарактеристикаНоменклатуры
	|			И ВТ_ТаблицаДокументаСоСкладами.Склад = ВТ_ОстаткиНаСкладах.Склад
	|ГДЕ
	|	НЕ ВТ_ТаблицаДокументаСоСкладами.Номенклатура ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	ПриоритетУсловия,
	|	ПриоритетСоответствия,
	|	ВТ_ТаблицаДокументаСоСкладами.ХарактеристикаНоменклатуры.КодSAP
	|ИТОГИ ПО
	|	НормаВыдачи,
	|	НоменклатураНормы,
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры";
	
	Запрос.УстановитьПараметр("ПериодРасчета",				Параметры.Дата);
	Запрос.УстановитьПараметр("Организация",				Параметры.Организация);
	Запрос.УстановитьПараметр("ВидВыдачиСИЗ",				Параметры.ВидВыдачиСИЗ);
	Запрос.УстановитьПараметр("ТаблицаДокумента",			ТаблицаДокумента);
	Запрос.УстановитьПараметр("ТаблицаСкладовВыдачи",		ТаблицаСкладовВыдачи);
	Запрос.УстановитьПараметр("ТаблицаРазмеров", 			ТаблицаРазмеров);
	Запрос.УстановитьПараметр("ОрганизацияДляОстатков",		?(ПолучитьФункциональнуюОпцию("НеВестиУчетОстатковНоменклатурыПоОрганизации"),Справочники.Организации.ПустаяСсылка(),Параметры.Организация));

	КорневаяВетка = ДеревоДанных.Строки.Добавить();
	КорневаяВетка.Представление = "Данные для подбора в документ выдачи";
	
	ВыборкаПоНормеВыдачи = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоНормеВыдачи.Следующий() Цикл
		
		ВеткаНормыВыдачи 						= КорневаяВетка.Строки.Добавить();
		ВеткаНормыВыдачи.НормаВыдачи 			= ВыборкаПоНормеВыдачи.НормаВыдачи;
		ВеткаНормыВыдачи.Представление 			= СокрЛП(ВыборкаПоНормеВыдачи.НормаВыдачи.Наименование);
		
		ВыборкаПоНоменклатуреНормы = ВыборкаПоНормеВыдачи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоНоменклатуреНормы.Следующий() Цикл
			
			ВеткаНоменклатурыНормы = ВеткаНормыВыдачи.Строки.Добавить();
			ВеткаНоменклатурыНормы.НоменклатураНормы 		= ВыборкаПоНоменклатуреНормы.НоменклатураНормы;
			ВеткаНоменклатурыНормы.КоличествоПотребность 	= ВыборкаПоНоменклатуреНормы.КоличествоПотребность;
			
			ВеткаНоменклатурыНормыЗаполнена = Ложь;
			
			ВыборкаПоНоменклатуре = ВыборкаПоНоменклатуреНормы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоНоменклатуре.Следующий() Цикл
				
				ВеткаНоменклатуры = ВеткаНоменклатурыНормы.Строки.Добавить();
				ВеткаНоменклатуры.Номенклатура 	= ВыборкаПоНоменклатуре.Номенклатура;
				ВеткаНоменклатуры.Количество 	= ВыборкаПоНоменклатуре.Количество;
				
				ВеткаНоменклатурыЗаполнена = Ложь;
				
				ВыборкаПоХарактеристикам = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоХарактеристикам.Следующий() Цикл
					
					ВеткаРазмера = ВеткаНоменклатуры.Строки.Добавить();
					ВеткаРазмера.ХарактеристикаНоменклатуры = ВыборкаПоХарактеристикам.ХарактеристикаНоменклатуры;
					
					ВеткаРазмераЗаполнена = Ложь;
					
					ВыборкаПоСкладам = ВыборкаПоХарактеристикам.Выбрать();
					Пока ВыборкаПоСкладам.Следующий() Цикл
						
						ВеткаНормыВыдачи.НомерСтрокиДокумента = ВыборкаПоСкладам.НомерСтроки;
						
						Если НЕ ВеткаНоменклатурыНормыЗаполнена Тогда
							ВеткаНоменклатурыНормы.Представление 		= СокрЛП(ВыборкаПоНоменклатуреНормы.НоменклатураНормы.Наименование) + " Требуется: "  +  ВыборкаПоСкладам.КоличествоПотребность;
							ВеткаНоменклатурыНормы.ДатаВыдачи			= ВыборкаПоСкладам.ДатаВыдачи;
							ВеткаНоменклатурыНормы.ДатаCледующейВыдачи 	= ВыборкаПоСкладам.ДатаСледующейВыдачи;
							ВеткаНоменклатурыНормыЗаполнена 			= Истина;
						КонецЕсли;
						
						Если НЕ ВеткаНоменклатурыЗаполнена Тогда
							ВеткаНоменклатуры.Представление 			= СокрЛП(ВыборкаПоНоменклатуре.Номенклатура.Наименование) + " К выдаче: " + ВыборкаПоСкладам.Количество;
							ВеткаНоменклатуры.Цена 						= ВыборкаПоСкладам.Цена;
							ВеткаНоменклатурыЗаполнена = Истина;
						КонецЕсли;
						
						Если НЕ ВеткаРазмераЗаполнена Тогда
							Если ВыборкаПоСкладам.ЕстьХарактеристики Тогда
								Если ВыборкаПоСкладам.РазмерПодходит Тогда
									ВеткаРазмера.Представление 	= СокрЛП(ВыборкаПоХарактеристикам.ХарактеристикаНоменклатуры.Наименование) + " (подходит по антропометрии)"; 
									ВеткаРазмера.РазмерПодходит = Истина;
								Иначе
									ВеткаРазмера.Представление = СокрЛП(ВыборкаПоХарактеристикам.ХарактеристикаНоменклатуры.Наименование);
								КонецЕсли;
							Иначе
								ВеткаРазмера.Представление = "Без размера.";
								ВеткаРазмера.РазмерПодходит = Истина;
							КонецЕсли;
							ВеткаРазмераЗаполнена = Истина;
						КонецЕсли;
					
						НоваяСтрока = ТаблицаДанных.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаПоСкладам);
						НоваяСтрока.СкладДокумента = (НоваяСтрока.Склад = Параметры.Склад);
						
						Если ВыборкаПоСкладам.Склад = Параметры.Склад Тогда
							Если ВыборкаПоСкладам.Остаток > 0 Тогда
								ВеткаРазмера.ЕстьНаСкладеДокумента 	= Истина;
								ВеткаРазмера.ЕстьНаДругихСкладах 	= Ложь;
							КонецЕсли;
						Иначе
							Если ВыборкаПоСкладам.Остаток > 0 И (НЕ ВеткаРазмера.ЕстьНаСкладеДокумента) Тогда
								ВеткаРазмера.ЕстьНаДругихСкладах 	= Истина;
							КонецЕсли;
						КонецЕсли;
							
					КонецЦикла;
					
				КонецЦикла
			
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаДанных.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, Склад, Остаток, СкладДокумента, ПроцентИзноса");
	
	ЗначениеВРеквизитФормы(ДеревоДанных,	"ДеревоДляПодбора");
	ЗначениеВРеквизитФормы(ТаблицаДанных,	"ТаблицаОстатков");
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоДанных()
	
	ЭлементыДерева = ЭтаФорма.ДеревоДляПодбора.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		ЭтаФорма.Элементы.ДеревоДляПодбора.Развернуть(ЭлементДерева.ПолучитьИдентификатор(),Ложь);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	АдресРезультатаПодбораВХранилище = ПоместитьРезультатыПодбораВХранилище();
	
	Структура = Новый Структура("АдресРезультатаПодбораВХранилище", АдресРезультатаПодбораВХранилище);
	
	Закрыть(КодВозвратаДиалога.ОК);
	
	ОповеститьОВыборе(Структура);

КонецПроцедуры

&НаКлиенте
Процедура ДеревоДляПодбораИспользоватьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоДляПодбора.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ХарактеристикаНоменклатуры) ИЛИ (ТекущиеДанные.Представление = "Без размера.") Тогда
			
			Если ТекущиеДанные.Использовать = 0 ИЛИ ТекущиеДанные.Использовать = 2 Тогда //флажок снимать запрещено
				ТекущиеДанные.Использовать = 1;
				Возврат;
			КонецЕсли;
			
			ТекущийИдентификатор = ТекущиеДанные.ПолучитьИдентификатор();
			
			//снимаем все флажки, кроме текущего
			ВеткаНормыВыдачи = ТекущиеДанные.ПолучитьРодителя().ПолучитьРодителя().ПолучитьРодителя();
			ВеткаНормыВыдачи.Использовать = 0;
			ВеткиНормыВыдачи = ВеткаНормыВыдачи.ПолучитьЭлементы();
			Для Каждого ВеткаНоменклатурыНормы Из ВеткиНормыВыдачи Цикл
				ВеткаНоменклатурыНормы.Использовать = 0;
				ВеткиНоменклатуры = ВеткаНоменклатурыНормы.ПолучитьЭлементы();
				Для Каждого ВеткаНоменклатуры Из ВеткиНоменклатуры Цикл
					ВеткаНоменклатуры.Использовать = 0;
					ВеткиХарактеристик = ВеткаНоменклатуры.ПолучитьЭлементы();
					Для Каждого ВеткаХарактеристики Из ВеткиХарактеристик Цикл
						Если НЕ ВеткаХарактеристики.ПолучитьИдентификатор() = ТекущийИдентификатор Тогда
							ВеткаХарактеристики.Использовать = 0;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
			ПроцедурыРаботыСНормамиКлиент.ОбходДереваВверх(ТекущиеДанные);
			ПроцедурыРаботыСНормамиКлиент.ОбходДереваВниз(ТекущиеДанные);
			
			Если СверткаПотребностиПоНоменклатуреНормы(Объект.Организация) Тогда
				
				ТекущаяНормаВыдачи 			= ВеткаНормыВыдачи.НормаВыдачи;
				ТекущаяНоменклатураНормы 	= ТекущиеДанные.ПолучитьРодителя().ПолучитьРодителя().НоменклатураНормы;
				ТекущаяНоменклатура 		= ТекущиеДанные.ПолучитьРодителя().Номенклатура;
				ТекущаяМетрика 				= ПолучитьМетрикуРазмера(ТекущиеДанные.ХарактеристикаНоменклатуры);
				
				//ищем ветки с текущей номенклатурой нормы
				КорневаяВетка = ВеткаНормыВыдачи.ПолучитьРодителя();
				ВеткиНормыВыдачи = КорневаяВетка.ПолучитьЭлементы();
				
				Для Каждого ВеткаНормыВыдачи Из ВеткиНормыВыдачи Цикл
					
					Если НЕ ВеткаНормыВыдачи.НормаВыдачи = ТекущаяНормаВыдачи Тогда
						Продолжить;
					КонецЕсли;
					
					ВеткиНоменклатурыНормы = ВеткаНормыВыдачи.ПолучитьЭлементы();
					
					Для Каждого ВеткаНоменклатурыНормы Из ВеткиНоменклатурыНормы Цикл
						
						Если Не ВеткаНоменклатурыНормы.НоменклатураНормы = ТекущаяНоменклатураНормы Тогда
							Продолжить;
						КонецЕсли;
						
						ВеткиНоменклатуры = ВеткаНоменклатурыНормы.ПолучитьЭлементы();
						
						Для Каждого ВеткаНоменклатуры Из ВеткиНоменклатуры Цикл
							
							ВеткиХарактеристик = ВеткаНоменклатуры.ПолучитьЭлементы();
							
							Если НЕ ВеткаНоменклатуры.Номенклатура = ТекущаяНоменклатура Тогда
								
								ВеткаНоменклатуры.Использовать = 0;
								
								Для Каждого ВеткаХарактеристики Из ВеткиХарактеристик Цикл
									
									ВеткаХарактеристики.Использовать = 0;
									
									ПроцедурыРаботыСНормамиКлиент.ОбходДереваВверх(ВеткаХарактеристики);
									
								КонецЦикла;
								
							Иначе
								
								Для Каждого ВеткаХарактеристики Из ВеткиХарактеристик Цикл
									
									МетрикаВетки = ПолучитьМетрикуРазмера(ВеткаХарактеристики.ХарактеристикаНоменклатуры);
									
									Если МетрикаВетки = ТекущаяМетрика Тогда
										ВеткаХарактеристики.Использовать = 1;
									Иначе
										ВеткаХарактеристики.Использовать = 0;
									КонецЕсли;
									
									ПроцедурыРаботыСНормамиКлиент.ОбходДереваВверх(ВеткаХарактеристики);
									
								КонецЦикла;
								
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЦикла; 
					
				КонецЦикла;
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СверткаПотребностиПоНоменклатуреНормы(ТекущаяОрганизация)

	Возврат ТекущаяОрганизация.СверткаПотребностиПоНоменклатуреНормы;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМетрикуРазмера(ТекущаяХарактеристика)

	Возврат ?(ЗначениеЗаполнено(ТекущаяХарактеристика),ТекущаяХарактеристика.Метрика,Справочники.Метрики.ПустаяСсылка());
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазвернутьДеревоДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДляПодбораПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоДляПодбора.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ХарактеристикаНоменклатуры) ИЛИ (ТекущиеДанные.Представление = "Без размера.") Тогда
			УстановитьОтборОстатков(ТекущиеДанные.ПолучитьРодителя().Номенклатура, ТекущиеДанные.ХарактеристикаНоменклатуры, ТекущиеДанные.ПроцентИзноса, ЭтаФорма);
		Иначе
			УстановитьОтборОстатков(ТекущиеДанные.Номенклатура, ТекущиеДанные.ХарактеристикаНоменклатуры, ТекущиеДанные.ПроцентИзноса, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборОстатков(Номенклатура, ХарактеристикаНоменклатуры, ПроцентИзноса, Форма)
	
	Форма.Элементы.ТаблицаОстатков.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура, ХарактеристикаНоменклатуры, ПроцентИзноса", Номенклатура, ХарактеристикаНоменклатуры, ПроцентИзноса);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДляПодбораПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоДляПодбора.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ХарактеристикаНоменклатуры) ИЛИ (ТекущиеДанные.Представление = "Без размера.") Тогда
			Отказ = Ложь;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьРезультатыПодбораВХранилище()
	
	ДеревоДанных = РеквизитФормыВЗначение("ДеревоДляПодбора");
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("НомерСтрокиДокумента");
	Товары.Колонки.Добавить("НоменклатураНормы");
	Товары.Колонки.Добавить("Номенклатура");
	Товары.Колонки.Добавить("ХарактеристикаНоменклатуры");
	Товары.Колонки.Добавить("ПроцентИзноса");
	Товары.Колонки.Добавить("ДатаВыдачи");
	Товары.Колонки.Добавить("ДатаСледующейВыдачи");
	Товары.Колонки.Добавить("Цена");
	
	Для Каждого КорневаяСтрока Из ДеревоДанных.Строки Цикл
		
		Для Каждого СтрокаНормыВыдачи Из КорневаяСтрока.Строки Цикл
			
			Если СтрокаНормыВыдачи.Использовать = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого СтрокаНоменклатурыНормы Из СтрокаНормыВыдачи.Строки Цикл
				
				Если СтрокаНоменклатурыНормы.Использовать = 0 Тогда
					Продолжить;
				КонецЕсли;	
				
				Для Каждого СтрокаНоменклатуры Из СтрокаНоменклатурыНормы.Строки Цикл
					
					Если СтрокаНоменклатуры.Использовать = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Для Каждого СтрокаХарактеристики Из СтрокаНоменклатуры.Строки Цикл
						
						Если СтрокаХарактеристики.Использовать = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						НоваяСтрока = Товары.Добавить();
						НоваяСтрока.НомерСтрокиДокумента 		= СтрокаНормыВыдачи.НомерСтрокиДокумента;
						НоваяСтрока.НоменклатураНормы			= СтрокаНоменклатурыНормы.НоменклатураНормы;
						НоваяСтрока.ДатаВыдачи					= СтрокаНоменклатурыНормы.ДатаВыдачи;
						НоваяСтрока.ДатаСледующейВыдачи			= СтрокаНоменклатурыНормы.ДатаCледующейВыдачи;
						НоваяСтрока.Номенклатура 				= СтрокаНоменклатуры.Номенклатура;
						НоваяСтрока.ХарактеристикаНоменклатуры 	= СтрокаХарактеристики.ХарактеристикаНоменклатуры; 
						НоваяСтрока.ПроцентИзноса 				= СтрокаХарактеристики.ПроцентИзноса;
						НоваяСтрока.Цена						= СтрокаНоменклатуры.Цена;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;

	АдресРезультатаПодбораВХранилище = ПоместитьВоВременноеХранилище(Товары, УникальныйИдентификатор);
	
	Возврат АдресРезультатаПодбораВХранилище;
	
КонецФункции

&НаКлиенте
Процедура ДеревоДляПодбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДеревоДляПодбора.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.НормаВыдачи) Тогда//открываем карточку нормы выдачи
		ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.НормаВыдачи);
		ОткрытьФорму("Справочник.НормыВыдачиСИЗ.Форма.ФормаЭлемента", ПараметрыФормы);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.НоменклатураНормы) Тогда//открываем карточку номенклатуры нормы
		ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.НоменклатураНормы);
		ОткрытьФорму("Справочник.НоменклатураНормОрганизации.Форма.ФормаЭлемента", ПараметрыФормы);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда//открываем карточку номенклатуры
		ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Номенклатура);
		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ХарактеристикаНоменклатуры) Тогда//открываем карточку характеристики номенклатуры
		ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.ХарактеристикаНоменклатуры);
		ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.Форма.ФормаЭлемента", ПараметрыФормы);	
	КонецЕсли;
	
КонецПроцедуры
